import { Component, OnInit } from '@angular/core';
import { FormBuilder, FormGroup } from '@angular/forms';
import { NzDrawerPlacement } from 'ng-zorro-antd/drawer';

@Component({
  selector: 'az-header',
  templateUrl: './header.component.html',
  styleUrls: ['./header.component.less'],
})
export class HeaderComponent implements OnInit {
  isOpened = false;
  activeLink!: number;
  visible = false;
  isWidth = '280px';
  placement: NzDrawerPlacement = 'left';
  categoryChilds: any = [];
  touched = false;
  serachInputDrawer = true
  inputValue = 2
  searchForm!: FormGroup;
  searchDropDown = false

  isAuth = false

  categories = [
    {
      icon: '../../../assets/images/agrozamin/tractor.svg',
      name: 'Сельхозтехника',
      id: 1,
      categories: [
        {
          name: 'Техника',
          categories: [
            { name: 'Тракторы' },
            { name: 'Минитехника' },
            { name: 'Транспортные средства для с/х' },
            { name: 'Погрузчики' },
            { name: 'Полуприцепы и прицепы' },
            { name: 'Сельхозтехника для хранения зерна' },
            { name: 'Электронные системы' },
          ],
        },
        {
          name: 'Техника для растениеводства',
          categories: [
            { name: 'Виноградоуборочные комбайны' },
            { name: 'Почвообрабатывающая техника' },
            { name: 'Посевные машины' },
            { name: 'Картофельная техника' },
            { name: 'Техника для внесения удобрений' },
            { name: 'Зерноочистительные машины' },
            { name: 'Зерносушилки' },
            { name: 'Опрыскиватели' },
            { name: 'Жатки' },
          ],
        },
        {
          name: 'Техника для животноводства',
          categories: [
            { name: 'Кормоуборочные комбайны' },
            { name: 'Кормозаготовительная техника' },
            { name: 'Оборудование для производства комбикормов' },
            { name: 'Кормораздатчики и смесители' },
          ],
        },
      ],
    },
    {
      icon: '../../../assets/images/agrozamin/seeds.svg',
      name: 'Семена',
      id: 2,
      categories: [
        {
          name: 'Семена',
          categories: [
            { name: 'Тракторы' },
            { name: 'Минитехника' },
            { name: 'Транспортные средства для с/х' },
            { name: 'Погрузчики' },
            { name: 'Полуприцепы и прицепы' },
            { name: 'Сельхозтехника для хранения зерна' },
            { name: 'Электронные системы' },
          ],
        },
        {
          name: 'Семена',
          categories: [
            { name: 'Виноградоуборочные комбайны' },
            { name: 'Почвообрабатывающая техника' },
            { name: 'Посевные машины' },
            { name: 'Картофельная техника' },
            { name: 'Техника для внесения удобрений' },
            { name: 'Зерноочистительные машины' },
            { name: 'Зерносушилки' },
            { name: 'Опрыскиватели' },
            { name: 'Жатки' },
          ],
        },
        {
          name: 'Семена',
          categories: [
            { name: 'Кормоуборочные комбайны' },
            { name: 'Кормозаготовительная техника' },
            { name: 'Оборудование для производства комбикормов' },
            { name: 'Кормораздатчики и смесители' },
          ],
        },
      ],
    },
    {
      icon: '../../../assets/images/agrozamin/fert.svg',
      name: 'Удобрения',
      id: 3,
      categories: [
        {
          name: 'Удобрения',
          categories: [
            { name: 'Тракторы' },
            { name: 'Минитехника' },
            { name: 'Транспортные средства для с/х' },
            { name: 'Погрузчики' },
            { name: 'Полуприцепы и прицепы' },
            { name: 'Сельхозтехника для хранения зерна' },
            { name: 'Электронные системы' },
          ],
        },
        {
          name: 'Удобрения',
          categories: [
            { name: 'Виноградоуборочные комбайны' },
            { name: 'Почвообрабатывающая техника' },
            { name: 'Посевные машины' },
            { name: 'Картофельная техника' },
            { name: 'Техника для внесения удобрений' },
            { name: 'Зерноочистительные машины' },
            { name: 'Зерносушилки' },
            { name: 'Опрыскиватели' },
            { name: 'Жатки' },
          ],
        },
        {
          name: 'Удобрения',
          categories: [
            { name: 'Кормоуборочные комбайны' },
            { name: 'Кормозаготовительная техника' },
            { name: 'Оборудование для производства комбикормов' },
            { name: 'Кормораздатчики и смесители' },
          ],
        },
      ],
    },
    {
      icon: '../../../assets/images/agrozamin/chemy.svg',
      name: 'Агрохимия',
      id: 4,
      categories: [
        {
          name: 'Агрохимия',
          categories: [
            { name: 'Тракторы' },
            { name: 'Минитехника' },
            { name: 'Транспортные средства для с/х' },
            { name: 'Погрузчики' },
            { name: 'Полуприцепы и прицепы' },
            { name: 'Сельхозтехника для хранения зерна' },
            { name: 'Электронные системы' },
          ],
        },
        {
          name: 'Агрохимия',
          categories: [
            { name: 'Виноградоуборочные комбайны' },
            { name: 'Почвообрабатывающая техника' },
            { name: 'Посевные машины' },
            { name: 'Картофельная техника' },
            { name: 'Техника для внесения удобрений' },
            { name: 'Зерноочистительные машины' },
            { name: 'Зерносушилки' },
            { name: 'Опрыскиватели' },
            { name: 'Жатки' },
          ],
        },
        {
          name: 'Агрохимия',
          categories: [
            { name: 'Кормоуборочные комбайны' },
            { name: 'Кормозаготовительная техника' },
            { name: 'Оборудование для производства комбикормов' },
            { name: 'Кормораздатчики и смесители' },
          ],
        },
      ],
    },
    {
      icon: '../../../assets/images/agrozamin/cow.svg',
      name: 'Сельскохозяйственные животные',
      id: 5,
      categories: [
        {
          name: 'Сельскохозяйственные животные',
          categories: [
            { name: 'Тракторы' },
            { name: 'Минитехника' },
            { name: 'Транспортные средства для с/х' },
            { name: 'Погрузчики' },
            { name: 'Полуприцепы и прицепы' },
            { name: 'Сельхозтехника для хранения зерна' },
            { name: 'Электронные системы' },
          ],
        },
        {
          name: 'Сельскохозяйственные животные',
          categories: [
            { name: 'Виноградоуборочные комбайны' },
            { name: 'Почвообрабатывающая техника' },
            { name: 'Посевные машины' },
            { name: 'Картофельная техника' },
            { name: 'Техника для внесения удобрений' },
            { name: 'Зерноочистительные машины' },
            { name: 'Зерносушилки' },
            { name: 'Опрыскиватели' },
            { name: 'Жатки' },
          ],
        },
        {
          name: 'Сельскохозяйственные животные',
          categories: [
            { name: 'Кормоуборочные комбайны' },
            { name: 'Кормозаготовительная техника' },
            { name: 'Оборудование для производства комбикормов' },
            { name: 'Кормораздатчики и смесители' },
          ],
        },
      ],
    },
    {
      icon: '../../../assets/images/agrozamin/corn.svg',
      name: 'Зерно',
      id: 6,
      categories: [
        {
          name: 'Зерно',
          categories: [
            { name: 'Тракторы' },
            { name: 'Минитехника' },
            { name: 'Транспортные средства для с/х' },
            { name: 'Погрузчики' },
            { name: 'Полуприцепы и прицепы' },
            { name: 'Сельхозтехника для хранения зерна' },
            { name: 'Электронные системы' },
          ],
        },
        {
          name: 'Зерно',
          categories: [
            { name: 'Виноградоуборочные комбайны' },
            { name: 'Почвообрабатывающая техника' },
            { name: 'Посевные машины' },
            { name: 'Картофельная техника' },
            { name: 'Техника для внесения удобрений' },
            { name: 'Зерноочистительные машины' },
            { name: 'Зерносушилки' },
            { name: 'Опрыскиватели' },
            { name: 'Жатки' },
          ],
        },
        {
          name: 'Зерно',
          categories: [
            { name: 'Кормоуборочные комбайны' },
            { name: 'Кормозаготовительная техника' },
            { name: 'Оборудование для производства комбикормов' },
            { name: 'Кормораздатчики и смесители' },
          ],
        },
      ],
    },
    {
      icon: '../../../assets/images/agrozamin/garden.svg',
      name: 'Сад и огород',
      id: 7,
      categories: [
        {
          name: 'Сад и огород',
          categories: [
            { name: 'Тракторы' },
            { name: 'Минитехника' },
            { name: 'Транспортные средства для с/х' },
            { name: 'Погрузчики' },
            { name: 'Полуприцепы и прицепы' },
            { name: 'Сельхозтехника для хранения зерна' },
            { name: 'Электронные системы' },
          ],
        },
        {
          name: 'Сад и огород',
          categories: [
            { name: 'Виноградоуборочные комбайны' },
            { name: 'Почвообрабатывающая техника' },
            { name: 'Посевные машины' },
            { name: 'Картофельная техника' },
            { name: 'Техника для внесения удобрений' },
            { name: 'Зерноочистительные машины' },
            { name: 'Зерносушилки' },
            { name: 'Опрыскиватели' },
            { name: 'Жатки' },
          ],
        },
        {
          name: 'Сад и огород',
          categories: [
            { name: 'Кормоуборочные комбайны' },
            { name: 'Кормозаготовительная техника' },
            { name: 'Оборудование для производства комбикормов' },
            { name: 'Кормораздатчики и смесители' },
          ],
        },
      ],
    },
    {
      icon: '../../../assets/images/agrozamin/transport.svg',
      name: 'Спецтехника',
      id: 8,
      categories: [
        {
          name: 'Спецтехника',
          categories: [
            { name: 'Тракторы' },
            { name: 'Минитехника' },
            { name: 'Транспортные средства для с/х' },
            { name: 'Погрузчики' },
            { name: 'Полуприцепы и прицепы' },
            { name: 'Сельхозтехника для хранения зерна' },
            { name: 'Электронные системы' },
          ],
        },
        {
          name: 'Спецтехника',
          categories: [
            { name: 'Виноградоуборочные комбайны' },
            { name: 'Почвообрабатывающая техника' },
            { name: 'Посевные машины' },
            { name: 'Картофельная техника' },
            { name: 'Техника для внесения удобрений' },
            { name: 'Зерноочистительные машины' },
            { name: 'Зерносушилки' },
            { name: 'Опрыскиватели' },
            { name: 'Жатки' },
          ],
        },
        {
          name: 'Спецтехника',
          categories: [
            { name: 'Кормоуборочные комбайны' },
            { name: 'Кормозаготовительная техника' },
            { name: 'Оборудование для производства комбикормов' },
            { name: 'Кормораздатчики и смесители' },
          ],
        },
      ],
    },
    {
      icon: '../../../assets/images/agrozamin/shield.svg',
      name: 'Средства защиты растений',
      id: 9,
      categories: [
        {
          name: 'Средства защиты растений',
          categories: [
            { name: 'Тракторы' },
            { name: 'Минитехника' },
            { name: 'Транспортные средства для с/х' },
            { name: 'Погрузчики' },
            { name: 'Полуприцепы и прицепы' },
            { name: 'Сельхозтехника для хранения зерна' },
            { name: 'Электронные системы' },
          ],
        },
        {
          name: 'Средства защиты растений',
          categories: [
            { name: 'Виноградоуборочные комбайны' },
            { name: 'Почвообрабатывающая техника' },
            { name: 'Посевные машины' },
            { name: 'Картофельная техника' },
            { name: 'Техника для внесения удобрений' },
            { name: 'Зерноочистительные машины' },
            { name: 'Зерносушилки' },
            { name: 'Опрыскиватели' },
            { name: 'Жатки' },
          ],
        },
        {
          name: 'Техника для животноводства',
          categories: [
            { name: 'Кормоуборочные комбайны' },
            { name: 'Кормозаготовительная техника' },
            { name: 'Оборудование для производства комбикормов' },
            { name: 'Кормораздатчики и смесители' },
          ],
        },
      ],
    },
    {
      icon: '../../../assets/images/agrozamin/tech.svg',
      name: 'Фермерское оборудование',
      id: 12,
      categories: [
        {
          name: 'Фермерское оборудование',
          categories: [
            { name: 'Тракторы' },
            { name: 'Минитехника' },
            { name: 'Транспортные средства для с/х' },
            { name: 'Погрузчики' },
            { name: 'Полуприцепы и прицепы' },
            { name: 'Сельхозтехника для хранения зерна' },
            { name: 'Электронные системы' },
          ],
        },
        {
          name: 'Фермерское оборудование',
          categories: [
            { name: 'Виноградоуборочные комбайны' },
            { name: 'Почвообрабатывающая техника' },
            { name: 'Посевные машины' },
            { name: 'Картофельная техника' },
            { name: 'Техника для внесения удобрений' },
            { name: 'Зерноочистительные машины' },
            { name: 'Зерносушилки' },
            { name: 'Опрыскиватели' },
            { name: 'Жатки' },
          ],
        },
        {
          name: 'Фермерское оборудование',
          categories: [
            { name: 'Кормоуборочные комбайны' },
            { name: 'Кормозаготовительная техника' },
            { name: 'Оборудование для производства комбикормов' },
            { name: 'Кормораздатчики и смесители' },
          ],
        },
      ],
    },
    {
      icon: '../../../assets/images/agrozamin/rubber.svg',
      name: 'Резинотехнические изделия',
      id: 13,
      categories: [
        {
          name: 'Резинотехнические изделия',
          categories: [
            { name: 'Тракторы' },
            { name: 'Минитехника' },
            { name: 'Транспортные средства для с/х' },
            { name: 'Погрузчики' },
            { name: 'Полуприцепы и прицепы' },
            { name: 'Сельхозтехника для хранения зерна' },
            { name: 'Электронные системы' },
          ],
        },
        {
          name: 'Резинотехнические изделия',
          categories: [
            { name: 'Виноградоуборочные комбайны' },
            { name: 'Почвообрабатывающая техника' },
            { name: 'Посевные машины' },
            { name: 'Картофельная техника' },
            { name: 'Техника для внесения удобрений' },
            { name: 'Зерноочистительные машины' },
            { name: 'Зерносушилки' },
            { name: 'Опрыскиватели' },
            { name: 'Жатки' },
          ],
        },
        {
          name: 'Резинотехнические изделия',
          categories: [
            { name: 'Кормоуборочные комбайны' },
            { name: 'Кормозаготовительная техника' },
            { name: 'Оборудование для производства комбикормов' },
            { name: 'Кормораздатчики и смесители' },
          ],
        },
      ],
    },
    {
      icon: '../../../assets/images/agrozamin/other.svg',
      name: 'Все товары',
      id: 14,
      categories: [
        {
          name: 'Все товары',
          categories: [
            { name: 'Тракторы' },
            { name: 'Минитехника' },
            { name: 'Транспортные средства для с/х' },
            { name: 'Погрузчики' },
            { name: 'Полуприцепы и прицепы' },
            { name: 'Сельхозтехника для хранения зерна' },
            { name: 'Электронные системы' },
          ],
        },
        {
          name: 'Все товары',
          categories: [
            { name: 'Виноградоуборочные комбайны' },
            { name: 'Почвообрабатывающая техника' },
            { name: 'Посевные машины' },
            { name: 'Картофельная техника' },
            { name: 'Техника для внесения удобрений' },
            { name: 'Зерноочистительные машины' },
            { name: 'Зерносушилки' },
            { name: 'Опрыскиватели' },
            { name: 'Жатки' },
          ],
        },
        {
          name: 'Все товары',
          categories: [
            { name: 'Кормоуборочные комбайны' },
            { name: 'Кормозаготовительная техника' },
            { name: 'Оборудование для производства комбикормов' },
            { name: 'Кормораздатчики и смесители' },
          ],
        },
      ],
    },
  ];

  searchParamas = [
    {type: 'История поиска:', id: 1, values: [
      {name: 'ворес', id: 1},
      {name: 'овощная сеялка', id: 2},
    ]},
    {type: 'Часто ищут:', id: 1, values: [
      {name: 'виноград', id: 1},
      {name: 'время кофе', id: 2},
    ]},
    {type: 'Категории:', id: 1, values: [
      {name: 'В мешках', id: 1},
    ]},
    {type: 'Продавец:', id: 1, values: [
      {name: 'ООО “Вымпел”', id: 1},
    ]},
    {type: 'Товары:', id: 1, values: [
      {name: 'Круглошлифовальный станок', id: 1},
    ]},
    {type: 'Производитель:', id: 1, values: [
      {name: 'ООО Company', id: 1},
    ]},
  ]

  constructor(private fb: FormBuilder) {}

  ngOnInit(): void {
    this.searchForm = this.fb.group({
      searchInput: [null],
      cityInput: [null]
    })
  }

  submit() {
    console.log(this.searchForm);  
  }

  showDropFilter() {

  }
  
  open(): void {
    this.visible = true;
  }

  close(): void {
    this.visible = false;
    this.isOpened = false;
  }

  openSubmenu(id: any) {
    this.isOpened = true;
    this.activeLink = id
  }

  closed() {
    this.isOpened = false;
  }

  getChild(id: any) {
    this.isOpened = true;
    this.categoryChilds = this.categories.filter(
      (e) => e.id === id
    )[0].categories;
  }

  calcDrawerWidth(): string {
    if (!this.isOpened) {
      return '280px';
    } else {
      let clientWidth = window.innerWidth;
      clientWidth = clientWidth * 0.65;

      if (clientWidth > 1355) {
        clientWidth = 1355;
      }
      ``;
      return `${clientWidth}px`;
    }
  }
}
